Revit 2026 API
FabricationUtils Methods
The FabricationUtils type exposes the following members.
Methods
Name | Description
ExportToPCF
ValidateConnectivity |  Check if two connectors are valid to connect directly without couplings.
Top
See Also
Reference
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace